<!-- placeholder-1 -->
```fish
tofu plan -chdir=opentofu
```
<!-- placeholder-2 -->

<details><summary>Diff of 4 changes.</summary>

```diff
+ google_artifact_registry_repository.artifact_registry_repository will be created
+ google_artifact_registry_repository_iam_member.workload_identity_binding will be created
+ google_cloud_run_v2_service.cloud_run_service will be created
+ google_service_account.cloud_run_service_account will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @aduuna at 2025-04-09T08:26:22Z [(view log)](https://github.com/Ishangoai/AIMS_course/actions/runs/14352538432/job/40234417010#step:4:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_artifact_registry_repository.artifact_registry_repository will be created
  + resource "google_artifact_registry_repository" "artifact_registry_repository" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "europe-west2"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "aims-course"
      + repository_id          = "aims-course-gcr"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # google_artifact_registry_repository_iam_member.workload_identity_binding will be created
  + resource "google_artifact_registry_repository_iam_member" "workload_identity_binding" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe-west2"
      + member     = "principalSet://iam.googleapis.com/projects/186773437176/locations/global/workloadIdentityPools/github/attribute.event_name/push"
      + project    = "aims-course"
      + repository = "aims-course-gcr"
      + role       = "roles/artifactregistry.writer"
    }

  # google_cloud_run_v2_service.cloud_run_service will be created
  + resource "google_cloud_run_v2_service" "cloud_run_service" {
      + client                  = "gcloud"
      + client_version          = "511.0.0"
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "GA"
      + location                = "europe-west2"
      + name                    = "aims-course-service"
      + observed_generation     = (known after apply)
      + project                 = "aims-course"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = "cloud-run-service@aims-course.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"
              + name       = "aims-course-image-1"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1000m"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 1
                  + initial_delay_seconds = 0
                  + period_seconds        = 240
                  + timeout_seconds       = 240

                  + tcp_socket {
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_service_account.cloud_run_service_account will be created
  + resource "google_service_account" "cloud_run_service_account" {
      + account_id   = "cloud-run-service"
      + disabled     = false
      + display_name = "Cloud Run Service Account"
      + email        = "cloud-run-service@aims-course.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:cloud-run-service@aims-course.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "aims-course"
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-13-9356be30ce23f45286094ba1a70e1e48.tfplan -->
<!-- placeholder-6 -->